JayHeng/cortex-m-apps/apps/coremark_imxrt1052/bsp/src/pu_irom_ocotp.h
#ifdef __cplusplus
extern "C" {
#endif

#ifndef _PU_IROM_OCOTP_H
#define _PU_IROM_OCOTP_H

/*=============================================================================

 Module Name:  pu_irom_ocotp.h

  General Description: Contains OCOTP fuse definitions.

===============================================================================
                    Copyright: 2008,2010,2011,2012,2013 FREESCALE, INC.
            All Rights Reserved. This file contains copyrighted material.
            Use of this file is restricted by the provisions of a
            Freescale Software License Agreement, which has either
            accompanied the delivery of this software in shrink wrap
            form or been expressly executed between the parties.

Portability: Portable to other compilers or platforms.

===============================================================================
                              INCLUDE FILES
=============================================================================*/
#include "fsl_common.h"
/*=============================================================================
                                  MACROS
=============================================================================*/

#define FUSE_BANK0_OFFSET         0x400
#define HW_FUSE_REG_ADDR(n)       (OCOTP_BASE + FUSE_BANK0_OFFSET + ((n) * 0x10))
#define HW_OCOTP_REG_RD(n)        (*(volatile uint32_t *)HW_FUSE_REG_ADDR(n))

/* ======================== Infinite loop ================================= */
#define ROM_OCOTP_INFINITE_LOOP_SHIFT  11
#define ROM_OCOTP_INFINITE_LOOP_MASK   (1 << ROM_OCOTP_INFINITE_LOOP_SHIFT)
#define ROM_OCOTP_INFINITE_LOOP_VALUE() \
        ((SRC->SBMR1&ROM_OCOTP_INFINITE_LOOP_MASK) >> ROM_OCOTP_INFINITE_LOOP_SHIFT)


/* ======================== Secure Code Protection ================================= */
#define ROM_OCOTP_SEC_CODE_PROTECTION_SHIFT 7
#define ROM_OCOTP_SEC_CODE_PROTECTION_MASK  (1 << ROM_OCOTP_SEC_CODE_PROTECTION_SHIFT)
#define ROM_OCOTP_SEC_CODE_PROTECTION_VALUE() \
        ((HW_OCOTP_REG_RD(0x06) & ROM_OCOTP_SEC_CODE_PROTECTION_MASK) >> ROM_OCOTP_SEC_CODE_PROTECTION_SHIFT)


/* ======================== FlexSPI NOR Boot ================================= */
/* Hold_Time */
#define ROM_OCOTP_HOLD_TIME_MASK    0x0000000C
#define ROM_OCOTP_HOLD_TIME_SHIFT   ((uint8_t)2)
#define ROM_OCOTP_HOLD_TIME_VALUE() \
        ((SRC->SBMR1&ROM_OCOTP_HOLD_TIME_MASK) >> ROM_OCOTP_HOLD_TIME_SHIFT)

/* Encrypted XIP */
#define ROM_OCOTP_ENCRYPT_XIP_MASK  0x00000002
#define ROM_OCOTP_ENCRYPT_XIP_SHIFT 0x01
#define ROM_OCOTP_ENCRYPT_XIP_VALAUE() \
        ((SRC->SBMR1&ROM_OCOTP_ENCRYPT_XIP_MASK) >> ROM_OCOTP_ENCRYPT_XIP_SHIFT)

/* Flash Type */
#define ROM_OCOTP_FLASH_TYPE_MASK   0x00000700
#define ROM_OCOTP_FLASH_TYPE_SHIFT  ((uint8_t)8)
#define ROM_OCOTP_FLASH_TYPE_VALUE()    \
        ((SRC->SBMR1&ROM_OCOTP_FLASH_TYPE_MASK) >> ROM_OCOTP_FLASH_TYPE_SHIFT)

/* Delay-Cell_Num */
#define ROM_OCOTP_DELAY_CELL_NUM_MASK   0x7F000000
#define ROM_OCOTP_DELAY_CELL_NUM_SHIFT  ((uint8_t)24)
#define ROM_OCOTP_DELAY_CELL_NUM_VALUE()    \
        ((HW_OCOTP_REG_RD(7)&ROM_OCOTP_DELAY_CELL_NUM_MASK) >> ROM_OCOTP_DELAY_CELL_NUM_SHIFT)

/* QSPI 2ND pinmux */
#define ROM_OCOTP_QSPI_SIP_2ND_BOOT_PIN_ENABLE_SHIFT 20U
#define ROM_OCOTP_QSPI_SIP_2ND_BOOT_PIN_ENABLE_MASK (1U << ROM_OCOTP_QSPI_SIP_2ND_BOOT_PIN_ENABLE_SHIFT)
#define ROM_OCOTP_QSPI_SIP_2ND_BOOT_PIN_ENABLE_VALUE() \
            ((HW_OCOTP_REG_RD(4) & ROM_OCOTP_QSPI_SIP_2ND_BOOT_PIN_ENABLE_MASK) >> ROM_OCOTP_QSPI_SIP_2ND_BOOT_PIN_ENABLE_SHIFT)

/* QSPI RESET pin enable */
#define ROM_OCOTP_FLEXSPI_RESET_PIN_ENABLE_SHIFT (7U)
#define ROM_OCOTP_FLEXSPI_RESET_PIN_ENABLE_MASK  (1U << ROM_OCOTP_FLEXSPI_RESET_PIN_ENABLE_SHIFT)
#define ROM_OCOTP_FLEXSPI_RESET_PIN_ENABLE_VALUE() \
            ((HW_OCOTP_REG_RD(0x2E) & ROM_OCOTP_FLEXSPI_RESET_PIN_ENABLE_MASK) >> ROM_OCOTP_FLEXSPI_RESET_PIN_ENABLE_SHIFT)
           
/* FlexSPI JEDEC HW reset enable */
#define ROM_OCOTP_FLEXSPI_JEDEC_HW_RESET_PIN_ENABLE_SHIFT (6U)
#define ROM_OCOTP_FLEXSPI_JEDEC_HW_RESET_PIN_ENABLE_MASK  (1U << ROM_OCOTP_FLEXSPI_JEDEC_HW_RESET_PIN_ENABLE_SHIFT)
#define ROM_OCOTP_FLEXSPI_JEDEC_HW_RESET_PIN_ENABLE_VALUE() \
            ((HW_OCOTP_REG_RD(0x2E) & ROM_OCOTP_FLEXSPI_JEDEC_HW_RESET_PIN_ENABLE_MASK) >> ROM_OCOTP_FLEXSPI_JEDEC_HW_RESET_PIN_ENABLE_SHIFT)



/* ====================== FlexSPI NAND Boot ================================= */
/* Safe Frequency */
#define ROM_OCOTP_SAFE_FREQ_MASK    0x00000020
#define ROM_OCOTP_SAFE_FREQ_SHIFT   ((uint8_t)5)
#define ROM_OCOTP_SAFE_FREQ_VALUE() \
        ((SRC->SBMR1&ROM_OCOTP_SAFE_FREQ_MASK) >> ROM_OCOTP_SAFE_FREQ_SHIFT)

/* COL_Address_width */
#define ROM_OCOTP_COL_ADDRESS_WIDTH_MASK    0x00000010
#define ROM_OCOTP_COL_ADDRESS_WIDTH_SHIFT   ((uint8_t)4)
#define ROM_OCOTP_COL_ADDRESS_WIDTH_VALUE() \
        ((SRC->SBMR1&ROM_OCOTP_COL_ADDRESS_WIDTH_MASK) >> ROM_OCOTP_COL_ADDRESS_WIDTH_SHIFT)

/* Boot_Search_Stride */
#define ROM_OCOTP_SPI_NAND_HOLD_TIME_MASK   0x0000000c
#define ROM_OCOTP_SPI_NAND_HOLD_TIME_SHIFT  ((uint8_t)2)
#define ROM_OCOTP_SPI_NAND_HOLD_TIME_VALUE()    \
        ((SRC->SBMR1&ROM_OCOTP_SPI_NAND_HOLD_TIME_MASK) >> ROM_OCOTP_SPI_NAND_HOLD_TIME_SHIFT)

/* Boot_Search_Stride */
#define ROM_OCOTP_BOOT_SEARCH_STRIDE_MASK   0x00000003
#define ROM_OCOTP_BOOT_SEARCH_STRIDE_SHIFT  ((uint8_t)0)
#define ROM_OCOTP_BOOT_SEARCH_STRIDE_VALUE()    \
        ((SRC->SBMR1&ROM_OCOTP_BOOT_SEARCH_STRIDE_MASK) >> ROM_OCOTP_BOOT_SEARCH_STRIDE_SHIFT)

/* Boot_Search_Count */
#define ROM_OCOTP_BOOT_SEARCH_COUNT_MASK    0x00000100
#define ROM_OCOTP_BOOT_SEARCH_COUNT_SHIFT   ((uint8_t)8)
#define ROM_OCOTP_BOOT_SEARCH_COUNT_VALUE() \
        ((SRC->SBMR1&ROM_OCOTP_BOOT_SEARCH_COUNT_MASK) >> ROM_OCOTP_BOOT_SEARCH_COUNT_SHIFT)

/* CS_Interval */
#define ROM_OCOTP_CS_INTERVAL_MASK  0x00000600
#define ROM_OCOTP_CS_INTERVAL_SHIFT ((uint8_t)9)
#define ROM_OCOTP_CS_INTERVAL_VALUE()   \
        ((SRC->SBMR1&ROM_OCOTP_CS_INTERVAL_MASK) >> ROM_OCOTP_CS_INTERVAL_SHIFT)

/* SPI NAND Boot - override Busy Offset */
#define ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_OVERRIDE_MASK   0x00000080
#define ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_OVERRIDE_SHIFT  ((uint8_t)7)
#define ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_OVERRIDE_VALUE()    \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_OVERRIDE_MASK) >>ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_OVERRIDE_SHIFT)

/* SPI NAND Boot - Busy Bit Offset */
#define ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_MASK    0x00003F00
#define ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_SHIFT   ((uint8_t)8)
#define ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_VALUE() \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_MASK) >> ROM_OCOTP_SPI_NAND_BOOT_BUSY_BIT_OFFSET_SHIFT)

/* Bypass_ECC_Read */
#define ROM_OCOTP_BYPASS_ECC_READ_MASK  0x00004000
#define ROM_OCOTP_BYPASS_ECC_READ_SHIFT ((uint8_t)14)
#define ROM_OCOTP_BYPASS_ECC_READ_VALUE()   \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_BYPASS_ECC_READ_MASK) >> ROM_OCOTP_BYPASS_ECC_READ_SHIFT)

/* Bypass_Read_Status */
#define ROM_OCOTP_BYPASS_READ_STATUS_MASK   0x00008000
#define ROM_OCOTP_BYPASS_READ_STATUS_SHIFT  ((uint8_t)15)
#define ROM_OCOTP_BYPASS_READ_STATUS_VALUE()    \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_BYPASS_READ_STATUS_MASK) >> ROM_OCOTP_BYPASS_READ_STATUS_SHIFT)

/* SPI NAND BOOT - Page read time */
#define ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_TIME_MASK   0x00003F00
#define ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_TIME_SHIFT  ((uint8_t)8)
#define ROM_OCOTP_SPI_NAND_BOOT_PAGE_FRD_TIME_VALUE()   \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_TIME_MASK) >> ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_TIME_SHIFT)

/* SPI NAND BOOT - page read cmd */
#define ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_CMD_MASK    0x00FF0000
#define ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_CMD_SHIFT   ((uint8_t)16)
#define ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_CMD_VALUE()    \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_CMD_MASK) >> ROM_OCOTP_SPI_NAND_BOOT_PAGE_RD_CMD_SHIFT)

/* SPI NAND BOOT - cache read cmd */
#define ROM_OCOTP_SPI_NAND_BOOT_CACHE_RD_CMD_MASK   0xFF000000
#define ROM_OCOTP_SPI_NAND_BOOT_CACHE_RD_CMD_SHIFT  ((uint8_t)24)
#define ROM_OCOTP_SPI_NAND_BOOT_CACHE_RD_CMD_VALUE()   \
        ((HW_OCOTP_REG_RD(0x2E)&ROM_OCOTP_SPI_NAND_BOOT_CACHE_RD_CMD_MASK) >> ROM_OCOTP_SPI_NAND_BOOT_CACHE_RD_CMD_SHIFT)

/* ======================== SEMC NOR Boot ================================= */
/* Clock Frequency */
#define ROM_OCOTP_SEMC_NOR_CLK_FREQ_MASK         0x00000007
#define ROM_OCOTP_SEMC_NOR_CLK_FREQ_SHIFT        ((uint8_t)0)
#define ROM_OCOTP_SEMC_NOR_CLK_FREQ_VALUE() \
        ((SRC->SBMR1&ROM_OCOTP_SEMC_NOR_CLK_FREQ_MASK) >> ROM_OCOTP_SEMC_NOR_CLK_FREQ_SHIFT)

