JayHeng/cortex-m-apps/apps/coremark_imxrt1052/bsp/src/pu_irom_ocotp.h
/* Force_Boot_from_fuse */
#define ROM_OCOTP_FORCE_COLD_BOOT_MASK  0x00000020
#define ROM_OCOTP_FORCE_COLD_BOOT_SHIFT ((uint8_t)5)
#define ROM_OCOTP_FORCE_COLD_BOOT_VALUE()   \
        ((HW_OCOTP_REG_RD(6)&ROM_OCOTP_FORCE_COLD_BOOT_MASK) >> ROM_OCOTP_FORCE_COLD_BOOT_SHIFT)

/* L2_HW_Invalidate_disable */
#define ROM_OCOTP_L2_HW_INVALIDATE_DISABLE_MASK 0x00000080
#define ROM_OCOTP_L2_HW_INVALIDATE_DISABLE_SHIFT    ((uint8_t)7)
#define ROM_OCOTP_L2_HW_INVALIDATE_DISABLE_VALUE()  \
        ((HW_OCOTP_REG_RD(6)&ROM_OCOTP_L2_HW_INVALIDATE_DISABLE_MASK) >> ROM_OCOTP_L2_HW_INVALIDATE_DISABLE_SHIFT)

/* Force Boot from Fuse fuse */
#define ROM_OCOTP_FORCE_INTERNAL_BOOT_MASK  0x00010000
#define ROM_OCOTP_FORCE_INTERNAL_BOOT_SHIFT ((uint8_t)16)
#define ROM_OCOTP_FORCE_INTERNAL_BOOT_VALUE()   \
        ((HW_OCOTP_REG_RD(6)&ROM_OCOTP_FORCE_INTERNAL_BOOT_MASK) >> ROM_OCOTP_FORCE_INTERNAL_BOOT_SHIFT)

/* SDP_ENABLE fuse */
#define ROM_OCOTP_SDP_DISABLE_MASK  0x00020000
#define ROM_OCOTP_SDP_DISABLE_SHIFT ((uint8_t)17)
#define ROM_OCOTP_SDP_DISABLE_VALUE()   \
        ((HW_OCOTP_REG_RD(6)&ROM_OCOTP_SDP_DISABLE_MASK) >> ROM_OCOTP_SDP_DISABLE_SHIFT)

/* SDP_READ_DISABLE Fuse */
#define ROM_OCOTP_SDP_READ_DISABLE_MASK 0x00040000
#define ROM_OCOTP_SDP_READ_DISABLE_SHIFT    ((uint8_t)18)
#define ROM_OCOTP_SDP_READ_DISABLE_VALUE()  \
        ((HW_OCOTP_REG_RD(6)&ROM_OCOTP_SDP_READ_DISABLE_MASK) >> ROM_OCOTP_SDP_READ_DISABLE_SHIFT)

/* WDOG enable fuse */
#define ROM_OCOTP_WDOG_ENABLE_MASK (0x00200000)
#define ROM_OCOTP_WDOG_ENABLE_SHIFT ((uint8_t)21)
#define ROM_OCOTP_WDOG_ENABLE_VALUE() \
    ((HW_OCOTP_REG_RD(6)&ROM_OCOTP_WDOG_ENABLE_MASK) >> ROM_OCOTP_WDOG_ENABLE_SHIFT)


/* XRDC_ENABLE fuse */
#define ROM_OCOTP_XRDC_ENABLE_MASK (0x10000000)
#define ROM_OCOTP_XRDC_ENABLE_SHIFT ((uint8_t)28)
#define ROM_OCOTP_XRDC_ENABLE_VALUE() \
        ((HW_OCOTP_REG_RD(6) & ROM_OCOTP_SRDC_ENABLE_MASK) >> ROM_OCOTP_SRDC_ENABLE_SHIFT)

/* =================== OCOTP CFG6 REGISTER ENTRIES END==========================*/


/* =================== OCOTP CFG7 REGISTER ENTRIES ==========================*/
/* L1 I-Cache DISABLE */
#define ROM_OCOTP_ICACHE_DISABLE_MASK (0x00000004)
#define ROM_OCOTP_ICACHE_DISABLE_SHIFT ((uint8_t)2)
#define ROM_OCOTP_ICACHE_DISABLE_VALUE() \
        ((HW_OCOTP_REG_RD(7) & ROM_OCOTP_ICACHE_DISABLE_MASK) >> ROM_OCOTP_ICACHE_DISABLE_SHIFT)

/* L1 D-Cache DISABLE */
#define ROM_OCOTP_DCACHE_DISABLE_MASK (0x00000002)
#define ROM_OCOTP_DCACHE_DISABLE_SHIFT ((uint8_t)1)
#define ROM_OCOTP_DCACHE_DISABLE_VALUE() \
        ((HW_OCOTP_REG_RD(7) & ROM_OCOTP_DCACHE_DISABLE_MASK) >> ROM_OCOTP_DCACHE_DISABLE_SHIFT)

/* UART Serial Download DISABLE */
#define ROM_OCOTP_UART_SERIAL_DOWNLOAD_DISABLE_MASK (0x00000010)
#define ROM_OCOTP_UART_SERIAL_DOWNLOAD_DISABLE_SHIFT ((uint8_t)4)
#define ROM_OCOTP_UART_SERIAL_DOWNLOAD_DISABLE_VALUE() \
            ((HW_OCOTP_REG_RD(7) & ROM_OCOTP_UART_SERIAL_DOWNLOAD_DISABLE_MASK) >> ROM_OCOTP_UART_SERIAL_DOWNLOAD_DISABLE_SHIFT)
/* =================== OCOTP CFG7 REGISTER ENTRIES END==========================*/


/* =================== OCOTP CFG8 REGISTER ENTRIES ==========================*/

/* LDO_VOLT_SETTING fuse */
#define LDO_VOLT_SETTING_MASK   (0x30000000)
#define LDP_VOLT_SETTING_SHIFT ((uint8_t)28)
#define LDP_VOLT_SETTING_VALUE() \
        ((HW_OCOTP_REG_RD(8) & LDO_VOLT_SETTING_MASK) >> LDP_VOLT_SETTING_SHIFT)

/* LDO_VOLT_CHANG_EN fuse */
#define LDO_VOLT_CHANG_EN_MASK (0x40000000)
#define LDO_VOLT_CHANG_EN_SHIFT ((uint8_t)30)
#define LDO_VOLT_CHANG_EN_VALUE() \
        ((HW_OCOTP_REG_RD(8) & LDO_VOLT_CHANG_EN_MASK) >> LDO_VOLT_CHANG_EN_SHIFT)

/* =================== OCOTP CFG8 REGISTER ENTRIES END==========================*/


/* =================== OCOTP CFG15 REGISTER ENTRIES ==========================*/

//#ifndef PROTOTYPE
/* VID overwrites in efuses */
#define OCOTP_GP1_CUST_USB_VID_MASK              (0x0000ffff)
#define OCOTP_GP1_CUST_USB_VID_SHIFT              ((uint8_t)0)

#define ROM_OCOTP_GP1_CUST_USB_VID() \
    ((HW_OCOTP_REG_RD(15)&OCOTP_GP1_CUST_USB_VID_MASK) >> OCOTP_GP1_CUST_USB_VID_SHIFT)

/* PID overwrites in efuses */
#define OCOTP_GP1_CUST_USB_PID_MASK              (0xffff0000)
#define OCOTP_GP1_CUST_USB_PID_SHIFT             ((uint8_t)16)

#define ROM_OCOTP_GP1_CUST_USB_PID() \
    ((HW_OCOTP_REG_RD(15)&OCOTP_GP1_CUST_USB_PID_MASK) >> OCOTP_GP1_CUST_USB_PID_SHIFT)
//#else // PROTOTYPE
//#define ROM_OCOTP_GP1_CUST_USB_VID() 0
//#define ROM_OCOTP_GP1_CUST_USB_PID() 0
//#endif // PROTOTYPE

/* =================== OCOTP CFG15 REGISTER ENTRIES END==========================*/


/* ===============OCOTP CFG45 REGISTER ENTRIES - 0x6D0 =======================*/

/* Pad setttings */
#define ROM_OCOTP_PAD_SETTINGS_MASK  (0x0000003F)
#define ROM_OCOTP_PAD_SETTINGS_SHIFT ((uint8_t)0)
#define ROM_OCOTP_PAD_SETTINGS_VALUE() \
    ((HW_OCOTP_REG_RD(45)&ROM_OCOTP_PAD_SETTINGS_MASK) >> ROM_OCOTP_PAD_SETTINGS_SHIFT)

/* USB_Vbus_event_Handler_en */
#define ROM_OCOTP_USB_VBUS_FIX_ENABLE_MASK  (0x00000040)
#define ROM_OCOTP_USB_VBUS_FIX_ENABLE_SHIFT ((uint8_t)6)
#define ROM_OCOTP_USB_VBUS_FIX_ENABLE() \
    ((HW_OCOTP_REG_RD(45)&ROM_OCOTP_USB_VBUS_FIX_ENABLE_MASK) >> ROM_OCOTP_USB_VBUS_FIX_ENABLE_SHIFT)



/* NAND read retry sequence select */
#define ROM_OCOTP_READ_RETRY_SEQ_ID_MASK   (0x00000F00)
#define ROM_OCOTP_READ_RETRY_SEQ_ID_SHIFT   ((uint8_t)8)
#define ROM_OCOTP_READ_RETRY_SEQ_ID() \
    ((HW_OCOTP_REG_RD(45)&ROM_OCOTP_READ_RETRY_SEQ_ID_MASK) >> ROM_OCOTP_READ_RETRY_SEQ_ID_SHIFT)

/* WDOG_Timeout_Select */
#define ROM_OCOTP_WDOG_TIMEOUT_SEL_SHIFT    ((uint8_t)13)
#define ROM_OCOTP_WDOG_TIMEOUT_SEL_MASK     (0x7u << ROM_OCOTP_WDOG_TIMEOUT_SEL_SHIFT)

#define ROM_OCOTP_WDOG_TIMEOUT_SEL_VALUE() \
      ((HW_OCOTP_REG_RD(45) & ROM_OCOTP_WDOG_TIMEOUT_SEL_MASK) >> ROM_OCOTP_WDOG_TIMEOUT_SEL_SHIFT)
      
/* MPU protection */
#define ROM_OCOTP_MPU_PROT_EN_SHIFT (12u)
#define ROM_OCOTP_MPU_PROT_EN_MASK  (1u << ROM_OCOTP_MPU_PROT_EN_SHIFT)
#define ROM_OCOTP_MPU_PROT_EN_VALUE() \
((HW_OCOTP_REG_RD(45) & ROM_OCOTP_MPU_PROT_EN_MASK) >> ROM_OCOTP_MPU_PROT_EN_SHIFT)

/* ============== OCOTP CFG45 REGISTER ENTRIES END - 0x6D0 ===================*/


/* ============= DCDC Trimmed value load ====================*/
#define ROM_OCOTP_DCDC_TRIM_EN_SHIFT (10)
#define ROM_OCOTP_DCDC_TRIM_EN_MASK  (1U << ROM_OCOTP_DCDC_TRIM_EN_SHIFT)
#define ROM_OCOTP_DCDC_TRIM_EN_VALUE() \
        ((HW_OCOTP_REG_RD(0x9)&ROM_OCOTP_DCDC_TRIM_EN_MASK) >> ROM_OCOTP_DCDC_TRIM_EN_SHIFT)

#define ROM_OCOTP_DCDC_VBG_TRIM_SHIFT (11)
#define ROM_OCOTP_DCDC_VBG_TRIM_MASK  (0x1FU << ROM_OCOTP_DCDC_VBG_TRIM_SHIFT)
#define ROM_OCOTP_DCDC_VBG_TRIM_VALUE() \
        ((HW_OCOTP_REG_RD(0x9)&ROM_OCOTP_DCDC_VBG_TRIM_MASK) >> ROM_OCOTP_DCDC_VBG_TRIM_SHIFT)

#define  ROM_OCOTP_DCDC_VOLT_CHANG_EN_SHIFT (30)
#define  ROM_OCOTP_DCDC_VOLT_CHANG_EN_MASK (1U << ROM_OCOTP_DCDC_VOLT_CHANG_EN_SHIFT)
#define ROM_OCOTP_DCDC_VOLT_CHANG_EN_VALUE() \
        ((HW_OCOTP_REG_RD(0x08)&ROM_OCOTP_DCDC_VOLT_CHANG_EN_MASK) >> ROM_OCOTP_DCDC_VOLT_CHANG_EN_SHIFT)

#define  ROM_OCOTP_DCDC_VOLT_SETTING_SHIFT (28)
#define  ROM_OCOTP_DCDC_VOLT_SETTING_MASK (3U << ROM_OCOTP_DCDC_VOLT_SETTING_SHIFT)
#define ROM_OCOTP_DCDC_VOLT_SETTING_VALUE() \
        ((HW_OCOTP_REG_RD(0x08)&ROM_OCOTP_DCDC_VOLT_SETTING_MASK) >> ROM_OCOTP_DCDC_VOLT_SETTING_SHIFT)


/* ================ OCOTP MISC. REGISTER ENTRIES ======================*/
/* Field_Return */
#define ROM_OCOTP_FIELD_RETURN_SHIFT    ((uint8_t)31)
#define ROM_OCOTP_FIELD_RETURN_MASK     (1U << ROM_OCOTP_FIELD_RETURN_SHIFT)
#define ROM_OCOTP_FIELD_RETURN_VALUE()  \
        ((HW_OCOTP_REG_RD(0x0)&ROM_OCOTP_FIELD_RETURN_MASK) >> ROM_OCOTP_FIELD_RETURN_SHIFT)

/* MC_ERA */
#define ROM_OCOTP_MC_ERA_MASK   0x0000FF00
#define ROM_OCOTP_MC_ERA_SHIFT  ((uint8_t)8)
#define ROM_OCOTP_MC_ERA_VALUE()    \
        ((HW_OCOTP_REG_RD(0x2F)&ROM_OCOTP_MC_ERA_MASK) >> ROM_OCOTP_MC_ERA_SHIFT)

/* AP_BI_Ver */
#define ROM_OCOTP_AP_BI_VER_MASK    0xFFFF0000
#define ROM_OCOTP_AP_BI_VER_SHIFT   ((uint8_t)24)
#define ROM_OCOTP_AP_BI_VER_VALUE() \
        ((HW_OCOTP_REG_RD(0x2F)&ROM_OCOTP_AP_BI_VER_MASK) >> ROM_OCOTP_AP_BI_VER_SHIFT)

/* ============= OCOTP MISC. REGISTER ENTRIES ====================*/

/*=============================================================================
                     TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
=============================================================================*/


/*=============================================================================
                        GLOBAL VARIABLE DECLARATIONS
=============================================================================*/

/*=============================================================================
                         Global FUNCTION PROTOTYPES
=============================================================================*/
#endif /* _PU_IROM_OCOTP_H */

#ifdef __cplusplus
}
#endif

